# -*- coding: utf-8 -*- 


red_skills = {
    'TrickStar':       (('明星昴流', '冰鹰北斗', '衣更真绪', '游木真'), 0.13),
    'UNDEAD':          (('大神晃牙', '朔间零', '乙狩阿多尼斯', '羽风薰'), 0.13),
    '轻音部':          (('朔间零', '大神晃牙', '葵日向', '葵裕太'), 0.13),
    '弓道部':          (('伏见弓弦', '莲巳敬人', '朱樱司', '月永雷欧'), 0.13),
    '红月':            (('鬼龙红郎', '莲巳敬人', '神崎飒马'), 0.10),
    '广播委员会':      (('仁兔成鸣', '仙石忍', '游木真'), 0.10),
    '名门子弟':        (('天祥院英智', '姬宫桃李', '朱樱司'), 0.10),
    '模特经验者':      (('濑名泉', '鸣上岚', '游木真'), 0.10),
    '空手道部':        (('鬼龙红郎', '南云铁虎'), 0.05),
    '最喜欢妹妹':      (('鬼龙红郎', '月永雷欧'), 0.05),
    'Switch':          (('春川宙', '逆先夏目','青叶纺'), 0.10),
    '弓箭高手们':      (('伏见弓弦', '莲巳敬人', '朱樱司', '月永雷欧'), 0.10),
}
yellow_skills = {
    'Knights':         (('濑名泉', '鸣上岚', '朔间凛月', '朱樱司'), 0.18),
    'fine':            (('天祥院英智', '日日树涉', '伏见弓弦', '姬宫桃李'), 0.13),
    '网球部':          (('姬宫桃李', '濑名泉', '仁兔成鸣', '游木真'), 0.13),
    '表演部':          (('日日树涉', '冰鹰北斗', '真白友也'), 0.10),
    '海洋生物':        (('羽风薰', '深海奏汰', '神崎飒马'), 0.10),
    '三奇人':          (('日日树涉', '深海奏汰', '朔间零'), 0.10),
    '左撇子':          (('天祥院英智', '朔间凛月', '葵裕太'), 0.10),
    # '擅长缝纫':        (('鬼龙红郎', '紫之创'), 0.05),
    # '擅长缝纫2':       (('鬼龙红郎', '紫之创','斋宫宗'), 0.10),
    '擅长缝纫3':       (('鬼龙红郎', '紫之创','斋宫宗','青叶纺'), 0.13),
    '忍者同好会':      (('仙石忍',), 0.02),
    'Valkyrie':        (('影片美伽','斋宫宗'), 0.05),
    '游戏研究部':      (('春川宙', '逆先夏目'), 0.05),
}
blue_skills = {
    '流星队':          (('高峯翠', '南云铁虎', '深海奏汰', '守泽千秋', '仙石忍'), 0.18),
    'Ra*bits':         (('仁兔成鸣', '天满光', '真白友也', '紫之创'), 0.13),
    '篮球部':          (('高峯翠', '明星昴流', '守泽千秋', '衣更真绪'), 0.13),
    '学生会执行部':    (('天祥院英智', '莲巳敬人', '衣更真绪', '姬宫桃李'), 0.13),
    '田径部':          (('鸣上岚', '天满光', '乙狩阿多尼斯'), 0.10),
    '红茶部':          (('天祥院英智', '朔间凛月', '紫之创'), 0.10),
    '2Wink':           (('葵日向', '葵裕太'), 0.05),
    '朔间兄弟':        (('朔间零', '朔间凛月'), 0.05),
    '花粉症':          (('大神晃牙', '衣更真绪'), 0.05),
    # '智慧眼镜':        (('莲巳敬人', '游木真'), 0.05),
    '智慧眼镜2':       (('莲巳敬人', '游木真', '青叶纺'), 0.10),
    # '手工部':          (('影片美伽','斋宫宗'), 0.05),
    '手工部2':         (('影片美伽','斋宫宗', '青叶纺'), 0.10),
    '图书管理员':      (('青叶纺',), 0.02),
}